---
kind: type
id: T:Autodesk.Revit.DB.ModelArc
source: html/614f29c1-b98f-bc6f-58fa-8a4b0be4536f.htm
---
# Autodesk.Revit.DB.ModelArc

Represents a ModelArc within Autodesk Revit.

## Syntax (C#)
```csharp
public class ModelArc : ModelCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
ModelCurve::geometryCurve property.